-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- 主機: localhost
-- 產生時間： 2018-06-04 13:42:58
-- 伺服器版本: 5.7.17-log
-- PHP 版本： 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `studentdb`
--

-- --------------------------------------------------------

--
-- 資料表結構 `score`
--

CREATE TABLE `score` (
  `studno` int(11) NOT NULL,
  `examno` tinyint(4) NOT NULL,
  `chi` tinyint(4) NOT NULL,
  `eng` tinyint(4) NOT NULL,
  `math` tinyint(4) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `score`
--

INSERT INTO `score` (`studno`, `examno`, `chi`, `eng`, `math`) VALUES
(850301, 1, 90, 76, 98),
(850302, 1, 58, 77, 75),
(850303, 1, 41, 14, 33),
(850304, 1, 95, 97, 87),
(850305, 1, 59, 66, 57),
(850306, 1, 28, 11, 33),
(850307, 1, 98, 100, 100),
(850308, 1, 0, 0, 10),
(850309, 1, 95, 74, 89),
(850310, 1, 41, 46, 49),
(850311, 1, 91, 99, 84),
(850312, 1, 0, 10, 0),
(850313, 1, 92, 92, 88),
(850314, 1, 35, 19, 29),
(850315, 1, 98, 90, 91),
(850316, 1, 47, 50, 55),
(850317, 1, 94, 94, 100),
(850318, 1, 79, 85, 77),
(850319, 1, 84, 74, 58),
(850320, 1, 54, 57, 64),
(850321, 1, 83, 80, 94),
(850322, 1, 71, 65, 73),
(850323, 1, 20, 25, 10),
(850324, 1, 93, 100, 90),
(850325, 1, 68, 56, 39),
(850326, 1, 25, 24, 0),
(850327, 1, 87, 77, 92),
(850328, 1, 64, 90, 59),
(850329, 1, 0, 0, 20),
(850330, 1, 77, 88, 99),
(850330, 2, 90, 76, 98),
(850329, 2, 58, 77, 75),
(850328, 2, 41, 14, 33),
(850327, 2, 95, 97, 87),
(850326, 2, 59, 66, 57),
(850325, 2, 28, 11, 33),
(850324, 2, 98, 100, 100),
(850323, 2, 0, 0, 10),
(850322, 2, 95, 74, 89),
(850321, 2, 41, 46, 49),
(850320, 2, 91, 99, 84),
(850319, 2, 0, 10, 0),
(850318, 2, 92, 92, 88),
(850317, 2, 35, 19, 29),
(850316, 2, 98, 90, 91),
(850315, 2, 47, 50, 55),
(850314, 2, 94, 94, 100),
(850313, 2, 79, 85, 77),
(850312, 2, 84, 74, 58),
(850311, 2, 54, 57, 64),
(850310, 2, 83, 80, 94),
(850309, 2, 71, 65, 73),
(850308, 2, 20, 25, 10),
(850307, 2, 93, 100, 90),
(850306, 2, 68, 56, 39),
(850305, 2, 25, 24, 0),
(850304, 2, 87, 77, 92),
(850303, 2, 64, 90, 59),
(850302, 2, 0, 0, 20),
(850301, 2, 77, 88, 99);

-- --------------------------------------------------------

--
-- 資料表結構 `student`
--

CREATE TABLE `student` (
  `studno` varchar(10) NOT NULL COMMENT '學號',
  `name` char(10) NOT NULL DEFAULT 'noname' COMMENT '姓名',
  `phone` char(13) DEFAULT NULL COMMENT '電話',
  `address` varchar(60) DEFAULT NULL COMMENT '地址'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `student`
--

INSERT INTO `student` (`studno`, `name`, `phone`, `address`) VALUES
('850301', '陳桶一', '02-24310667', '基隆市安樂區安和一街4巷4-3號4F'),
('850302', '黃光權', '02-24971835', '台北縣瑞芳鎮一坑路426號'),
('850303', '胡生妙', '02-24570828', '基隆市暖暖區源遠路292巷1-5號1F'),
('850304', '王為全', '02-24970773', '台北縣瑞芳鎮逢甲路337號'),
('850305', '李日正', '02-24322272', '基隆市安樂區安和一街6巷43之1號2F'),
('850306', '劉德菖', '02-24518685', '基隆市七堵區百六街53號3F'),
('850307', '方正一', '02-24974327', '台北縣瑞芳鎮三爪子坑路106 巷11號3'),
('850308', '劉康寶', '02-24318360', '基隆市獅球路111巷39號2F'),
('850309', '謝掬花', '02-24275530', '基隆市信義區義六路36-34 號3F'),
('850310', '王美蘭', '02-24693021', '基隆市中正區調和街80巷63號'),
('850311', '徐小噹', '02-24287732', '基隆市中正區正義路74巷30弄40號'),
('850312', '葉小毛', '02-24969168', '台北縣瑞芳鎮大寮路49巷1 號'),
('850313', '林東海', '02-24977208', '台北縣瑞芳鎮東和路84號'),
('850314', '林大陽', '02-24582284', '基隆市暖暖區金山街74號'),
('850315', '鍾德級', '02-24327347', '基隆市安樂區麥金路11巷40號'),
('850316', '劉力錦', '02-24974586', '台北縣瑞芳鎮中山路246巷11號2F'),
('850317', '方小坊', '02-24941334', '台北縣貢寮鄉龍崗村泮宮路17號'),
('850318', '劉記成', '02-24979021', '台北縣瑞芳鎮三爪子坑路民享新村11'),
('850319', '李普三', '02-24230092', '基隆市中山區中華路135-3 號4F'),
('850320', '劉一心', '02-24514121', '基隆市七堵區泰安路91號'),
('850321', '方日通', '02-24654770', '基隆市信義區東峰街11巷2 號'),
('850322', '劉順成', '02-24579700', '台北縣瑞芳鎮大埔路48號3F'),
('850323', '謝利利', '02-24564111', '基隆市七堵區東新街4巷66 號'),
('850324', '王涵合', '02-24288344', '基隆市中山區協和街192-1 號'),
('850325', '徐佳佳', '02-24983355', '台北縣萬里鄉員潭路6號'),
('850326', '李宏仁', '02-24286086', '基隆市中正區中正路182巷33-1號'),
('850327', '林大鈺', '02-24651306', '基隆市信義區深澳路226-1 號'),
('850328', '林玉成', '02-24331399', '基隆市安樂區武嶺街274之2號3F'),
('850329', '鍾百達', '02-24231258', '基隆市中山區通明街53巷7 號'),
('850330', '小巨人', '02-24573928', '基隆市暖暖區國安路30巷6 號1F'),
('123456', 'aaaa', '0988123456', 'qweasdzxc'),
('11', '11', '11', '11'),
('444', '444', '444', '444');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `score`
--
ALTER TABLE `score`
  ADD PRIMARY KEY (`studno`,`examno`);

--
-- 資料表索引 `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`studno`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
